000010 IDENTIFICATION                   DIVISION.
000020 PROGRAM-ID.                      JJHK602P.
000030*****************************************************************
000040*  ‹Æ–±–¼        FWebRings ‘–¯Œ’N•ÛŒ¯
000050*
000060*  ŒÚ‹q–¼        F‰z’JŽs
000070*
000080*  ƒvƒƒZƒX–¼    F”[Å’Ê’m‘iŒ»”N“xˆê”Ê—pj
000090*
000100*  ˆ—–¼        F”[Å’Ê’m‘‚Ì‚o‚c‚e‰»
000110*
000120*  ˆ—ŠT—v      F”[Å’Ê’m‘iŒ»”N“xˆê”Ê—pjƒvƒŠƒ“ƒgƒtƒ@ƒCƒ‹‚ð
000130*                  “Ç‚Ýž‚ÝA”[Å’Ê’m‘‚ð•ÒWEo—Í‚·‚éB
000140*
000150*  ŽÀsŽžƒR[ƒhŒnFUCS2
000160*
000170*  •¶ŽšƒR[ƒh    FÃÞ°À”¼Šp€–Ú    FSJIS¨Unicode(UTF8)•ÏŠ·
000180*                  “ú–{ŒêÃÞ°À€–Ú  FUnicode
000190*
000200*  ì•\•ûŽ®      F’ •[Š¿Žš€–Ú    FFUJ–¾’©‘ÌÌ«ÝÄ–„‚ßž‚Ý•ûŽ®
000210*                  ’ •[’è‹`‘ÌŒ`Ž®  Fƒy[ƒW•ûŽ®iÊß°Ã¨¼®Ý‚ ‚èj
000220*
000230*  ’ •[’è‹`‘Ì    FJJHK602.pmd
000240*
000250*  ì¬ŽÒ        FINES / ‹e’r‘P•F
000260*
000270*  ì¬“ú        F2013.07.09
000280*
000290*  C³—š—ð      F
000300*    C³”NŒŽ“ú  -----------------  C³“à—e  -------------------
000310*    2022/02/18  ‹àÎ“Œ  ˆÄŒID:76360  @—š—ðID:220215KI
000320*                ƒŠƒRƒ“ƒpƒCƒ‹‚Ì‚ÝŽÀŽ{
000330*    2023/10/06  ’I‹´    ˆÄŒID:77024  @—š—ðID:231006MT
000340*                ƒŠƒRƒ“ƒpƒCƒ‹‚Ì‚ÝŽÀŽ{
000350*    2025/12/22@ƒAƒCƒlƒX@ƒgƒEƒ“@ˆÄŒIDF77480@@—š—ðID:251222TL
000360*                JJ—ß˜a8”N“x–@‰ü³”[Å’Ê’m‘‰üC‘Î‰ž
000370*                JJHK602.PMD •ÏX‚É”º‚¤ƒŠƒRƒ“ƒpƒCƒ‹
000380*
000390*****************************************************************
000400*                    ŠÂ@@‹«@@•”
000410*****************************************************************
000420 ENVIRONMENT                      DIVISION.
000430*****************************************************************
000440*================================================================
000450 CONFIGURATION                    SECTION.
000460*================================================================
000470 SOURCE-COMPUTER.                 F-PC
000480*DBG*           WITH  DEBUGGING  MODE
000490     .
000500 OBJECT-COMPUTER.                 F-PC.
000510*
000520*================================================================
000530 INPUT-OUTPUT                     SECTION.
000540*================================================================
000550 FILE-CONTROL.
000560      SELECT   LST-F
000570          ASSIGN  TO  PRTFILE
000580          FORMAT  IS  LST-FORMAT
000590          GROUP   IS  LST-GROUP
000600          FILE STATUS  IS  LST-STATUS  Ú×ƒR[ƒh.
000610*
000620*****************************************************************
000630 DATA                             DIVISION.
000640*****************************************************************
000650*================================================================
000660 FILE                             SECTION.
000670*================================================================
000680*i‚n‚t‚sj
000690 FD  LST-F.
000700      COPY    JJHK602             OF  XMDLIB.
000710*================================================================
000720 WORKING-STORAGE                  SECTION.
000730*================================================================
000740 01  ABEND                        PIC  X(006)  VALUE 'ABENDU'.
000750*----------------------------------------------------------------
000760*    “üo—Í’è‹`—Ìˆæ
000770*----------------------------------------------------------------
000780*i‚h‚mj
000790 01  PRINT-DATA-LEN               PIC S9(009).
000800 01  PARM-KAMA021A-PRINTIN.
000810   03  “ü—Í‚c‚c–¼‚P‚R             PIC  X(008)  VALUE 'PRINTIN'.
000820   03  “ü—Íˆ—•û–@‚P‚R           PIC  X(008)  VALUE SPACE.
000830   03  “ü—Í‚q‚k‚P‚R               PIC S9(009)  COMP-5.
000840   03  “ü—Í‚a‚k‚P‚R               PIC S9(009)  COMP-5.
000850   03  “ü—ÍŒ”‚P‚R               PIC S9(009)  COMP-5.
000860   03  ‚d‚n‚eî•ñ‚P‚R             PIC  X(004)  VALUE SPACE.
000870*
000880 01  U13-REC.
000890   03  §ŒäƒGƒŠƒA.
000900     05  ‰üsŽwŽ¦                 PIC  X(006).
000910     05  s”‚q.
000920       07   s”                  PIC  9(004).
000930   03  sƒpƒ^[ƒ“                 PIC  X(030).
000940   03  ƒvƒŠƒ“ƒgƒf[ƒ^.
000950     05  ƒvƒŠƒ“ƒgƒf[ƒ^|“à—e     PIC  X(001)
000960                                  OCCURS  1  TO   32760 TIMES
000970                                  DEPENDING  ON   PRINT-DATA-LEN.
000980*
000990*----------------------------------------------------------------
001000*    ŒÅ’è’l—Ìˆæ
001010*----------------------------------------------------------------
001020 01  CPID                         PIC  X(008)  VALUE 'JJHK602P'.
001030 01  ‚b’ •[’è‹`‘Ì–¼’Ê’mˆæ         PIC  X(008)  VALUE 'JJHK602'.
001040 01  ‚b€–ÚŒQ’Ê’mˆæ‚P             PIC  X(008)  VALUE 'GROUP1'.
001050 01  ‚b€–ÚŒQ’Ê’mˆæ‚Q             PIC  X(008)  VALUE 'GROUP2'.
001060 01  ‚b€–ÚŒQ’Ê’mˆæ‚R             PIC  X(008)  VALUE 'GROUP3'.
001070 01  ‚b€–ÚŒQ’Ê’mˆæ‚S             PIC  X(008)  VALUE 'GROUP4'.
001080 01  CNS-1                        PIC  9(001)  VALUE 1.
001090*
001100*----------------------------------------------------------------
001110*    ’ •[§Œä—Ìˆæ
001120*----------------------------------------------------------------
001130 01  LST-FORMAT                   PIC  X(008).
001140 01  LST-GROUP                    PIC  X(008).
001150 01  LST-STATUS                   PIC  X(002).
001160 01  Ú×ƒR[ƒh                   PIC  X(004).
001170 01  ’ •[ƒy[ƒW”                 PIC S9(009)  COMP-5 VALUE ZERO.
001180 01  o—Í‘ÎÛƒy[ƒW”             PIC S9(009)  COMP-5 VALUE ZERO.
001190*
001200* ‚r‚i‚h‚rƒR[ƒh”¼ŠpƒJƒi•¶Žš—ñŒÅ’è’l
001210   COPY    SJISKANA.
001220*
001230 01  ‚v‚j‚»‚Ì‘¼—Ìˆæ.
001240   03  ‚v‚jˆ—“ú                 PIC  X(008).
001250   03  ‚v‚jˆ—Žž                 PIC  9(008).
001260*
001270*----------------------------------------------------------------
001280 LINKAGE                          SECTION.
001290*----------------------------------------------------------------
001300*
001310 01  PARM-AREA.
001320     COPY  PCBPARMP.
001330*
001340/****************************************************************
001350 PROCEDURE                        DIVISION
001360                                  USING PARM-AREA.
001370*****************************************************************
001380* ƒtƒ@ƒCƒ‹ƒAƒNƒZƒXƒGƒ‰[Žž‚ÌŒë‚èˆ—Žè‘±‚«
001390     COPY  PCBFILERR
001400           REPLACING  ==@@@@@@@@@@==  BY  ==LST-F==
001410                      ==((((((((((==  BY  ==LST-STATUS==
001420                      ==))))))))))==  BY  ==Ú×ƒR[ƒh==.
001430*****************************************************************
001440*================================================================
001450 ƒƒCƒ“ˆ—                       SECTION.
001460*================================================================
001470 ƒƒCƒ“ˆ—|ŠJŽn.
001480*
001490     PERFORM  ‘Oˆ—.
001500*
001510     PERFORM  Žåˆ—  UNTIL  ‚d‚n‚eî•ñ‚P‚R  =  ‚bƒIƒƒŠ.
001520*
001530     PERFORM  Œãˆ—.
001540*
001550 ƒƒCƒ“ˆ—|I—¹.
001560     STOP RUN.
001570*================================================================
001580 ‘Oˆ—                           SECTION.
001590*================================================================
001600 ‘Oˆ—|ŠJŽn.
001610*
001620     DISPLAY '*** ' CPID ' START VER.'
001630              FUNCTION  WHEN-COMPILED(1:8) ' ***'  UPON  SYSOUT.
001640*
001650* ’ •[o—Í‚Ì‹¤’ÊŽÀsƒpƒ‰ƒ[ƒ^‚Ìƒ`ƒFƒbƒN(PCBPRPCK.CPY‚Æ‘Î‰ž)
001660     COPY  PCBPRPCK.
001670*
001680* Žg—p•Ï”Aƒ[ƒN—Ìˆæ‚Ì‰Šú‰»
001690     INITIALIZE                       ‚v‚j‚»‚Ì‘¼—Ìˆæ.
001700*
001710     PERFORM  “ú•tŽž•\Ž¦.
001720*
001730     PERFORM  ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“.
001740*
001750     PERFORM  ’ •[ƒtƒ@ƒCƒ‹“Çžˆ—.
001760*
001770 ‘Oˆ—|I—¹.
001780     EXIT.
001790*================================================================
001800 ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“                 SECTION.
001810*================================================================
001820 ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“|ŠJŽn.
001830*
001840     COMPUTE  PRINT-DATA-LEN      =   FUNCTION LENG(JJHK602).
001850     MOVE  'OPEN'                 TO  “ü—Íˆ—•û–@‚P‚R.
001860     COMPUTE  “ü—Í‚q‚k‚P‚R        =   FUNCTION  LENG(U13-REC).
001870*
001880     CALL  'KAMA021A'          USING  PARM-KAMA021A-PRINTIN.
001890*
001900     OPEN  OUTPUT  LST-F.
001910*
001920 ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“|I—¹.
001930     EXIT.
001940*================================================================
001950 ’ •[ƒtƒ@ƒCƒ‹“Çžˆ—             SECTION.
001960*================================================================
001970 ’ •[ƒtƒ@ƒCƒ‹“Çžˆ—|ŠJŽn.
001980*
001990     MOVE  'READ'                 TO  “ü—Íˆ—•û–@‚P‚R.
002000     CALL  'KAMA021A'          USING  PARM-KAMA021A-PRINTIN
002010                                      U13-REC.
002020     IF      ‚d‚n‚eî•ñ‚P‚R  =  ‚bƒIƒƒŠ
002030        GO TO    ’ •[ƒtƒ@ƒCƒ‹“Çžˆ—|I—¹
002040     END-IF.
002050*
002060     IF  sƒpƒ^[ƒ“(1:6)  =  ‚b€–ÚŒQ’Ê’mˆæ‚P(1:6)
002070         ADD   CNS-1               TO  o—Í‘ÎÛƒy[ƒW”
002080     END-IF.
002090*
002100*    ******************************************************
002110*    * ’ •[o—Í”ÍˆÍƒ`ƒFƒbƒN‚Ì‹¤’Êˆ—(PCBPARMP.CPY‚Æ‘Î‰ž) *
002120*    ******************************************************
002130     IF  PARM-PRINT-S  > ZERO
002140       IF  o—Í‘ÎÛƒy[ƒW”  >=  PARM-PRINT-S
002150         IF   PARM-PRINT-E  <  999999999
002160           IF  o—Í‘ÎÛƒy[ƒW”  <=  PARM-PRINT-E
002170             CONTINUE
002180           ELSE
002190             GO TO    ’ •[ƒtƒ@ƒCƒ‹“Çžˆ—|ŠJŽn
002200           END-IF
002210         ELSE
002220           CONTINUE
002230         END-IF
002240       ELSE
002250         GO TO    ’ •[ƒtƒ@ƒCƒ‹“Çžˆ—|ŠJŽn
002260       END-IF
002270     ELSE
002280       CONTINUE
002290     END-IF.
002300*
002310*
002320 ’ •[ƒtƒ@ƒCƒ‹“Çžˆ—|I—¹.
002330     EXIT.
002340*================================================================
002350 Žåˆ—                           SECTION.
002360*================================================================
002370 Žåˆ—|ŠJŽn.
002380*
002390     PERFORM  ’ •[o—Íˆ—.
002400*
002410     PERFORM  ’ •[ƒtƒ@ƒCƒ‹“Çžˆ—.
002420*
002430 Žåˆ—|I—¹.
002440     EXIT.
002450*================================================================
002460 ’ •[o—Íˆ—                     SECTION.
002470*================================================================
002480 ’ •[o—Íˆ—|ŠJŽn.
002490*
002500     MOVE  ƒvƒŠƒ“ƒgƒf[ƒ^         TO  JJHK602.
002510     MOVE  ‚b’ •[’è‹`‘Ì–¼’Ê’mˆæ   TO  LST-FORMAT.
002520     EVALUATE  sƒpƒ^[ƒ“(1:6)
002530       WHEN  ‚b€–ÚŒQ’Ê’mˆæ‚P(1:6)
002540         MOVE  ‚b€–ÚŒQ’Ê’mˆæ‚P   TO  LST-GROUP
002550*        ’ •[ƒy[ƒW”‚ÌƒJƒEƒ“ƒ^‚ÍGROUP1‚Ìo—ÍŽž‚ÉƒAƒbƒv
002560         ADD  CNS-1               TO  ’ •[ƒy[ƒW”
002570       WHEN  ‚b€–ÚŒQ’Ê’mˆæ‚Q(1:6)
002580         MOVE  ‚b€–ÚŒQ’Ê’mˆæ‚Q   TO  LST-GROUP
002590       WHEN  ‚b€–ÚŒQ’Ê’mˆæ‚R(1:6)
002600         MOVE  ‚b€–ÚŒQ’Ê’mˆæ‚R   TO  LST-GROUP
002610       WHEN  ‚b€–ÚŒQ’Ê’mˆæ‚S(1:6)
002620         MOVE  ‚b€–ÚŒQ’Ê’mˆæ‚S   TO  LST-GROUP
002630     END-EVALUATE.
002640*
002650     WRITE  JJHK602   AFTER  PAGE.
002660*
002670 ’ •[o—Íˆ—|I—¹.
002680     EXIT.
002690*================================================================
002700 Œãˆ—                           SECTION.
002710*================================================================
002720 Œãˆ—|ŠJŽn.
002730*
002740     IF  “ü—Íˆ—•û–@‚P‚R  NOT = SPACE
002750         MOVE  'CLOSE'            TO  “ü—Íˆ—•û–@‚P‚R
002760         CALL  'KAMA021A'      USING  PARM-KAMA021A-PRINTIN
002770     ELSE
002780         CONTINUE
002790     END-IF.
002800*
002810     CLOSE  LST-F.
002820*
002830     DISPLAY '(INPUT) '
002840             'PRINTIN:“ü—Íƒtƒ@ƒCƒ‹ = '
002850             “ü—ÍŒ”‚P‚R  ' Œ'                 UPON  SYSOUT.
002860*
002870     DISPLAY '(OUTPUT)'
002880             'PRTFILE:o—Í’ •[     = '
002890             ’ •[ƒy[ƒW”  ' •Å'                 UPON  SYSOUT.
002900*
002910     PERFORM  “ú•tŽž•\Ž¦.
002920*
002930     DISPLAY '*** ' CPID ' END ***'              UPON  SYSOUT.
002940*
002950     DISPLAY ' '                                 UPON  SYSOUT.
002960*
002970 Œãˆ—|I—¹.
002980     EXIT.
002990*================================================================
003000 “ú•tŽž•\Ž¦                     SECTION.
003010*================================================================
003020 “ú•tŽž•\Ž¦|ŠJŽn.
003030*
003040     PERFORM “ú•tŽžŽæ“¾.
003050*
003060     DISPLAY '(' CPID ') '
003070          ‚v‚jˆ—“ú(1:4) '/' ‚v‚jˆ—“ú(5:2) '/' ‚v‚jˆ—“ú(7:2)
003080      ' ' ‚v‚jˆ—Žž(1:2) ':' ‚v‚jˆ—Žž(3:2) ':' ‚v‚jˆ—Žž(5:2)
003090                                                 UPON  SYSOUT.
003100*
003110 “ú•tŽž•\Ž¦|I—¹.
003120     EXIT.
003130*================================================================
003140 “ú•tŽžŽæ“¾                     SECTION.
003150*================================================================
003160 “ú•tŽžŽæ“¾|ŠJŽn.
003170*
003180     MOVE  FUNCTION  CURRENT-DATE
003190                                  TO  ‚v‚jˆ—“ú.
003200     ACCEPT  ‚v‚jˆ—Žž         FROM  TIME.
003210*
003220 “ú•tŽžŽæ“¾|I—¹.
003230     EXIT.
003240*****************************************************************
003250*              << JJHK602P PROGRAM END >>                       *
003260*****************************************************************
003270 END PROGRAM JJHK602P.
